/*

1. Пользователь вводит с клавиатуры целое шестизначное число. Написать программу, которая определяет,
является ли введенное число – счастливым (Счастливым считается шестизначное число, у которого сумма первых 
3 цифр равна сумме вторых трех цифр). Если пользователь ввел не шестизначное число – сообщение об ошибке.
*/


#include <iostream>


using namespace std;

void main() {
	int number;
	int num_1, num_2;
	int a, b, c ,d;
	setlocale(LC_ALL, "russian"); /**/
	cout << "Введите шестизначное число \n";
	cin >> number;
	if (number < 100000) {
		cout << "Вы ввели не шестизначное число, попробуйте ещё раз. \n";
	}
	cout << number <<"\n";
	num_1 = number / 1000;
	num_2 = number - num_1 * 1000;

	
	//a = (num_1 / 10 - int(num_1 / 10)) * 10;
	//b = (num_1 / 100);

	/*
	a = (num_1 / 100)*100;
	b = ((num_1 -a)/10)*10;
	c = (num_1 - a) - ((num_1 - a) / 10) * 10;
	*/



	/*
	a = (num_1 / 100) * 100;
	b = ((num_1 - (num_1 / 100) * 100) / 10) * 10;
	c = (num_1 - a) - ((num_1 - a) / 10) * 10;
	 */
	
	/*
	a = (num_1 / 100) * 100;
	b = ((num_1 - (num_1 / 100) * 100) / 10) * 10;
	c = (num_1 - (num_1 / 100) * 100) - ((num_1 - (num_1 / 100) * 100) / 10) * 10; */

	/*a = (num_1 / 100) ;
	b = ((num_1 - (num_1 / 100) * 100) / 10) ;
	c = (num_1 - (num_1 / 100) * 100) - ((num_1 - (num_1 / 100) * 100) / 10) * 10; */


	a = (num_1 / 100);
	b = ((num_1 - (num_1 / 100) * 100) / 10);
	c = (num_1 - (num_1 / 100) * 100) - ((num_1 - (num_1 / 100) * 100) / 10) * 10;
	//d = a + b + c;


	d = (num_1 / 100) + ((num_1 - (num_1 / 100) * 100) / 10) + (num_1 - (num_1 / 100) * 100) - ((num_1 - (num_1 / 100) * 100) / 10) * 10;
	

	cout << "num_1 = " << num_1 << " \n";
	cout << "num_2 = " << num_2 << " \n";


	//cout << "i = " << i << "\n";
	cout << "a = " << a << "\n";
	cout << "b= " << b << "\n";
	cout << "c=" << c << "\n";
	cout << "d = " << d << "\n";
}