/*
Написать программу, которая выводит на экран таблицу умножения на k,
где k – номер варианта и вводится с клавиатуры. Например, для 7-го варианта: 
7 x 2 = 14 7 x 3 = 21
и т.д.
*/
#include <iostream>
using namespace std;

void main(){
	setlocale(LC_ALL, "rus");
	int i = 1, j = 1;
	cout << "Таблица умножения : \n";
	while (i <10){
		j = 1;
		while (j != 11){
			cout << i << " * " << j << " = " << i*j << "\t";
			cout << i + 1 << " * " << j << " = " << (i + 1)*j << "\t";
			cout << i + 2 << " * " << j << " = " << (i + 2)*j << "\n";
			j++;
		}
		i = i + 3;
		cout << "\n \n";
		
	}
}